cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'zsh'
brew 'antigen'
brew 'readline'
brew 'node'
brew 'nvm'
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'cowsay'
brew 'fortune'
brew 'lolcat'
brew 'carthage'
brew 'kubectl'
brew 'Nonchalant/appicon/appicon'

cask 'atom'
cask 'google-chrome'
cask 'opera'
cask 'iterm2'
cask 'fastlane'
cask 'spotify'
cask 'slack'
cask 'sip'
cask 'docker'


tap 'caskroom/fonts'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-code'
cask 'font-monofur'
cask 'font-hack'
