cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'zsh'
brew 'antigen'
brew 'readline'
brew 'node'
brew 'nvm'
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'tldr'
brew 'cowsay'
brew 'fortune'
brew 'lolcat'
brew 'z'
brew 'mas'
brew 'carthage'

tap 'caskroom/cask'
cask 'visual-studio-code'
cask 'opera'
cask 'iterm2'
cask 'spotify'
cask 'dropbox'
cask '1password'
cask 'insomnia'
cask 'docker'
cask 'keepingyouawake'

tap 'caskroom/fonts'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-firacode-nerd-font'
cask 'font-fira-code'
cask 'font-monofur'
cask 'font-hack'

mas 'Affinity Designer', id: 824171161
mas 'XCode', id: 497799835
mas 'Magnet', id: 441258766
