cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'zsh'
brew 'stow'
brew 'zoxide'
brew 'antidote'
brew 'readline'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'tlrc'
brew 'coreutils'
brew 'robotsandpencils/made/xcodes'
brew 'aria2'
brew 'fd'
brew 'bat'
brew 'fzf'
brew 'eza'

cask 'visual-studio-code'
cask 'firefox'
cask 'wezterm'
cask 'xcodes'
cask '1password'
cask 'insomnia'
cask 'nikitabobko/tap/aerospace'
cask 'keepingyouawake'
cask 'raycast'

tap 'homebrew/cask-fonts'
cask 'font-cascadia-code'
cask 'font-caskaydia-cove-nerd-font'